app/Controllers/AdminController.php

SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`id_categoria`
---
   public function listarProductos(){

      $data['titulo'] = 'Productos';
      echo view('plantillas\head',$data);
      echo view('plantillas\nav_admin');

      $productoModel = model('App\Models\ProductoModel');

      $data['productos'] = $productoModel->join('categorias', 'categorias.id_categoria = productos.id_categoria')->findAll();