app/Controllers/Home.php

    public function catalogo(){
        $data['titulo'] = 'Productos';
        echo view('plantillas\head',$data);
        echo view('plantillas\nav');

        $categoriaModel = model('App\Models\CategoriaModel');
        $productoModel = model('App\Models\ProductoModel');

        $data['productos'] = $productoModel->where('estado_producto', 0)->join('categorias', 'categorias.id_categoria = productos.id_categoria')->find();
---
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`id_categoria`
WHERE `estado_producto` = 0