app/Controllers/ProductController.php

SELECT *
FROM `categorias`
SELECT *
FROM `productos`
JOIN `categorias` ON `categorias`.`id_categoria` = `productos`.`id_categoria`
WHERE `id_producto` = '12'
 LIMIT 1
---
    public function mostrarProducto($id = 12){
        $productoModel = model('App\Models\ProductoModel');
        $categoriaModel = model('App\Models\CategoriaModel');
        $data['categorias'] = $categoriaModel->findAll();
        $data['producto'] = $productoModel->join('categorias', 'categorias.id_categoria = productos.id_categoria')->where('id_producto',$id)->first();