app/Controllers/UserController.php

    public function registrarUsuario(){

        $validation = \Config\Services::validation();
        $request = \Config\Services::request();

        $validation->setRules([
            'nombre'=>'required',
            'apellido'=>'required',
            'email'=>'required|valid_email|is_unique[usuarios.email_usuario]',
            'pass'=>'required|min_length[8]',
            'repass'=>'required|min_length[8]|matches[pass]',]);


            if($validation->withRequest($this->request)->run()){

                $datos = [
                    'nombre_usuario' => $request->getPost('nombre'),
                    'apellido_usuario' => $request->getPost('apellido'),
                    'email_usuario'=>$request->getPost('email'),
                    'contrasena_usuario'=>password_hash($request->getPost('pass'),PASSWORD_BCRYPT),
                    'estado_usuario'=>1,
                    'id_perfil'=>1

            ];

                $registro_usuario= new RegistroModel();

                $registro_usuario->insert($datos);
---
INSERT INTO `usuarios` (`nombre_usuario`, `apellido_usuario`, `email_usuario`, `contrasena_usuario`, `estado_usuario`, `id_perfil`) VALUES ('Pepito', 'Salas', 'pepe@hotmail.com', '$2y$10$PNKAj4hRF0WrBangNxXPsOUYev6Rjd3xA3skHRRV1VwgZEHHaYCue', 1, 1)

    public function inciarSesion(){
        $validation = \Config\Services::validation();
        $request = \Config\Services::request();

        $validation->setRules([
            'email'=>'required|valid_email',
            'pass'=>'required|min_length[8]'
        ]);

        if($validation->withRequest($this->request)->run()){

            $session = session();
            $userModel = model('App\Models\RegistroModel');

            $mail = $request->getPost('email');
            $pass = $request->getPost('pass');

            $user = $userModel->asArray()->where('email_usuario', $mail)->first();
---
SELECT *
FROM `usuarios`
WHERE `email_usuario` = 'admin@gmail.com'
 LIMIT 1